crash detection II
